{
    "title": "BeanScene Coffee Chain - Profitability Decline",

    "opening": "BeanScene is a national coffee chain with 500 locations. Revenue is up 5% year-over-year, but profits are down 20%. The CEO wants to understand why and what to do about it.\n\nOver to you.",

    "facts": {
        "revenue": {
            "total_growth": "+5% YoY",
            "price_vs_volume": "All from price increases; volume is flat",
            "same_store_traffic": "Flat (0% growth)",
            "product_mix": {
                "coffee_share": "70% of revenue",
                "food_share": "30% of revenue",
                "food_attachment_trend": "Up 15% (customers buying more food with coffee)"
            },
            "promotional_sales": "Up 20% (more discounting)"
        },
        "costs": {
            "labour": {
                "change": "+18% YoY",
                "drivers": "Wage inflation (+8%) plus scheduling inefficiency (+10%)",
                "detail": "New menu items increased complexity; barista time per drink up 12%"
            },
            "coffee_beans": {
                "change": "+8% YoY",
                "driver": "Commodity price pressure"
            },
            "rent": "Flat",
            "food_ingredients": "+5% YoY",
            "packaging": "+3% YoY"
        },
        "margins": {
            "coffee_margin": "70% (down from 75% due to bean costs)",
            "food_margin": "35% (always been lower)",
            "blended_trend": "Declining because mix shifting toward lower-margin food"
        },
        "stores": {
            "total_count": 500,
            "performance_variance": "Top quartile 3x more profitable than average",
            "bottom_quartile": "Negative EBITDA (losing money)",
            "new_store_cannibalization": "15% of new stores are cannibalizing existing locations"
        }
    },

    "root_cause": "80% of profit decline comes from:\n1. Labour cost explosion (+18%) driven by menu complexity and wage inflation\n2. Mix shift toward lower-margin food products\n3. Revenue growth is 'hollow' - all price, no volume, plus more discounting\n\nNOT the main driver: Coffee bean costs (+8%) - this is a red herring that weak candidates fixate on.",

    "strong_recommendations": [
        "Simplify menu to reduce labour time per transaction",
        "Address bottom-quartile stores (close or fix)",
        "Reconsider food strategy - it's diluting margins",
        "Reduce promotional/discount activity"
    ],

    "calibration": {
        "level_5": {
            "name": "Outstanding",
            "sounds_like": [
                "Before I dive in - is the 20% decline on absolute profit or margin? And is this across all stores or concentrated?",
                "Revenue up but profit down sharply tells me costs grew faster than revenue. Given the magnitude - 20% profit decline on 5% revenue growth - this isn't a small cost creep, something structural changed.",
                "I'd want to separate: is the revenue growth real? Is it price or volume? And on costs - what's fixed versus variable, and which moved?",
                "Labour at +18% is the standout. That's not just wage inflation - something operational is broken. What changed in how stores operate?"
            ],
            "characteristics": "Forms hypotheses before asking for data. Sees through the numbers to underlying drivers. Prioritizes ruthlessly. Catches red herrings."
        },
        "level_4": {
            "name": "Clear Pass",
            "sounds_like": [
                "Let me structure this as profit equals revenue minus costs. Revenue is up, so this is likely a cost problem.",
                "Can I see the cost breakdown? I'd expect the issue to be in variable costs since those would scale with any operational changes.",
                "Labour is the biggest increase at 18%. I'd want to understand if that's wage rates, headcount, or efficiency.",
                "For recommendations, I'd prioritize the labour issue since it's the largest driver."
            ],
            "characteristics": "Clear structure. Asks logical questions. Identifies the main driver. Solid but doesn't find the nuances."
        },
        "level_3": {
            "name": "Good But Not Enough",
            "sounds_like": [
                "I'd look at revenue and costs separately.",
                "Can I see the income statement or cost breakdown?",
                "Costs are up across the board. Labour and beans seem high.",
                "They should try to reduce costs and maybe look at pricing."
            ],
            "characteristics": "Basic structure. Asks for data but not targeted. Sees issues but doesn't prioritize. Generic recommendations."
        },
        "level_2": {
            "name": "Weak",
            "sounds_like": [
                "So profits are down... what information do you have?",
                "Can you tell me more about the business?",
                "It seems like costs are the problem. They should cut costs.",
                "Maybe they could raise prices or open more stores?"
            ],
            "characteristics": "No structure. Waits to be fed information. States the obvious. Recommendations don't follow from analysis."
        },
        "level_1": {
            "name": "Fail",
            "sounds_like": [
                "They should cut costs and raise prices.",
                "It's probably inflation.",
                "I'm not sure where to start.",
                "Can you walk me through it?"
            ],
            "characteristics": "No structure. Jumps to conclusions. Cannot engage with the problem. Needs to be led entirely."
        }
    },

    "red_flags": [
        "Fixates on coffee bean costs as the main issue (it's only +8%)",
        "Ignores the labour cost explosion",
        "Doesn't question the quality of revenue growth",
        "Jumps to 'raise prices' without checking if they already did",
        "Cannot do basic math (if revenue +5% and profit -20%, costs grew significantly faster)",
        "Suggests 'cut costs' without identifying which costs matter"
    ],

    "green_flags": [
        "Recognizes profit decline magnitude implies structural cost change",
        "Asks if revenue growth is price or volume",
        "Identifies labour as the key cost driver",
        "Probes WHY labour costs increased (not just that they did)",
        "Notices the mix shift toward lower-margin products",
        "Questions store-level variance",
        "Recommendations are specific and prioritized"
    ]
}
